Repository: aadilHaffez/payment-sdk-ios
Catalog: NISdk/Resources/Localizations/*.lproj/Localizable.strings
Languages: ar

source: Expires
ar: تاريخ الانتهاء شهر/سنة

source: MM
ar: شهر

source: YY
ar: عام

source: Number
ar: رقم

source: Card Number
ar: رقم البطاقة

source: Cardholder Name
ar: اسم حامل البطاقة

source: Name
ar: اسم

source: CVV
ar: رقم التحقق

source: Secure Code
ar: رقم التحقق

source: Pay
ar: ادفع الآن

source: Make Payment
ar: الدفع

source: Processing Payment
ar: جاري التحميل

# Pay Button Title
source: Pay %@
ar: %@ إدفع

# Invalid pan number
source: Invalid card number
ar: رقم البطاقة غير صحيح

# Invalid card provider
source: This card provider is not allowed
ar: مصدر البطاقة غير مسموح

source: Invalid expiry date
ar: تاريخ الصلاحية منتهي

source: Invalid CVV Field
ar: حقل رقم التحقق غير صحيح

source: Invalid card holder name
ar: اسم حامل البطاقة غير صحيح

source: All fields are mandatory
ar: كل الحقول مطلوبة

source: Cancel
ar: إلغاء

source: Authenticating Payment
ar: التحقق من الدفع

source: Authenticating using 3DS
ar: التحقق من الدفع

# Cancel Payment Title
source: Cancel Payment
ar: إلغاء الدفع

# Cancel Payment Message
source: Are you sure you want to cancel the payment?
ar: هل أنت متأكد أنك تريد إلغاء الدفع؟

# Cancel Alert
source: No
ar: لا

# Cancel Confirm
source: Yes, Cancel
ar: نعم، ألغِ

source: Yes
ar: نعم

# Visa Instalment Eligible
source: Eligible for Installments
ar: مؤهلة للتقسيط

# Visa Monthly Instalment
source: Monthly Installment: %@
ar: %@ القسط الشهري

# Visa Bi Monthly Instalment
source: Bi-Monthly Installment: %@
ar: %@ القسط كل شهرين

# Visa Weekly Instalment
source: Weekly Installment: %@
ar: %@ القسط الأسبوعي

# Visa Bi Weekly Instalment
source: Bi-Weekly Installment: %@
ar: %@ القسط كل أسبوعين

# Visa Monthly Rate
source: Monthly Rate: %@ %%
ar: %% %@ :السعر الشهري:

# Visa Bi Monthly Rate
source: Bi-Monthly Rate: %@ %%
ar: %% %@ :السعر كل شهرين:

# Visa Weekly Rate
source: Weekly Rate: %@ %%
ar: %% %@ :السعر الأسبوعي

# Visa Bi Weekly Rate
source: Bi-Weekly Rate: %@ %%
ar: %% %@ :السعر كل أسبوعين

# Visa Processing Fee
source: Processing Fees: %@
ar: %@ رسوم المعالجة

# Visa Terms And Conditions
source: Terms and Conditions
ar: البنود والشروط

# Visa Read Less
source: Read less
ar: اقرأ أقل

# Visa Read More
source: Read more
ar: اقرأ المزيد

# Visa Pay In Instalment
source: Pay in %@
ar: %@ الدفع بمقدار

# Visa Pay In Full
source: Pay in Full
ar: الدفع بالكامل

# Patial Auth Title
source: Customer confirmation
ar: تأكيد العميل

# Partial Auth Message With Org
source: Your issuing bank %@ has approved %@ instead of the full amount of %@.
ar: تمت الموافقة من قبل البنك %@ على %@ بدلاً من المبلغ الكامل لـ %@

# Partial Auth Message
source: Your issuing bank has approved %@ instead of the full amount of %@.
ar: تمت الموافقة من قبل البنك على %@ بدلاً من المبلغ الكامل لـ %@

# Partial Auth Message Question
source: Do you wish to process the transaction with the reduced amount?
ar: هل ترغب في المضي قدما مع المبلغ المخفض؟

# aani_paying_amount
source: Paying %@
ar: جارٍ دفع %@

# aani_tap_notification
source: Tap the notification received in your app to complete the payment.
ar: اضغط على الإشعار الذي تلقيته في التطبيق لإكمال عملية الدفع.

# aani_note_do_not_close
source: Please do not close the app while the timer is running.
ar: ملاحظة: يرجى عدم إغلاق التطبيق أثناء تشغيل المؤقت.

# aani_mobile_number
source: رقم الجوال
ar: Mobile number

# aani_emirates_id
source: الهوية الإماراتية
ar: Emirates ID

# aani_passport_id
source: رقم جواز السفر
ar: Passport ID

# aani_email_id
source: البريد الإلكتروني
ar: Email ID

# aani_alias_type
source: نوع الاسم المستعار
ar: Alias type
